<template>
  <div class="container">
    <card v-for="(spell, index) in spells"
          :key="index"
          :state="spell"/>
  </div>
</template>

<script>
import Card from "./Card";
export default {
  name: "CardContainer",
  data() {
    return {
      spells: [
        {
          name: "Изобилие врагов [Enemies abound]",
          level: 3,
          description: "Вы достигаете сознания одного существа, которое вы можете видеть, и заставляете его сделать спасбросок Интеллекта. Существо автоматически преуспевает, если оно невосприимчиво к испугу. В случае неудачного спасброска цель теряет способность отличать друзей от врагов, относясь ко всем существам, которых она может видеть, как к врагам, пока заклинание не закончится. Каждый раз, когда цель получает урон, она может повторить спасбросок, окончив эффект на себе при успехе.\n" +
              "\n" +
              "Всякий раз, когда существо под действием заклинания выбирает другое существо в качестве цели, оно должно выбирать цель случайным образом среди существ, которых она может видеть в пределах дистанции атаки, заклинания или других способностей, которые она использует. Если враг провоцирует атаку от существа под действием заклинания, существо должно совершить эту атаку, если это возможно.",
          castTime: "1 действие",
          distance: "120 футов",
          components: "В, С",
          duration: "Концентрация, вплоть до 1 минуты",
          magicSchool: "Очарование",
          ritual: "Не ритуал"
        },
        {
          name: "Истинное воскрешение [True resurrection]",
          level: 9,
          description: "Вы касаетесь существа, мёртвого не больше двух сотен лет, умершего от чего угодно кроме старости. Если душа цели свободна и согласна, цель возвращается к жизни с полными хитами.\n" +
              "\n" +
              "Это заклинание закрывает все раны, нейтрализует все яды, исцеляет все болезни и снимает все проклятья, бывшие у существа в момент смерти. Заклинание заменяет повреждённые и отсутствующие органы и части тела.\n" +
              "\n" +
              "Это заклинание может даже воссоздать новое тело, если старого больше нет. В этом случае вы должны произнести вслух имя существа. Это существо появляется в свободном пространстве, выбранном вами в пределах 10 футов.",
          castTime: "1 час",
          distance: "Касание",
          components: "В, С, М (немного святой воды и бриллианты, стоящие как минимум 25 000 зм, расходуемые заклинанием)",
          duration: "Мгновенная",
          magicSchool: "Некромантия",
          ritual: "Не ритуал"
        },
        {
          name: "Отилюков упругий шар [Otiluke’s resilient sphere]",
          level: 4,
          description: "Сфера из мерцающей силы окружает находящееся в пределах дистанции существо или предмет с размером не больше Большого. Нежелающее существо должно совершить спасбросок Ловкости. При провале существо окружается сферой на время действия заклинания. Ничто — ни физические предметы, ни энергия, ни эффекты прочих заклинаний — не могут проходить через этот барьер, как внутрь, так и наружу, хотя существо в сфере может дышать нормально. Сфера обладает иммунитетом ко всем видам урона, и находящееся внутри существо или предмет не может получать урон от атак и эффектов, исходящих снаружи, но и находящееся в сфере существо не может причинить урон ничему, что находится снаружи. Сфера ничего не весит, и она достаточно велика, чтобы вместить существо или предмет. Окруженное существо может действием толкать стены сферы и таким образом перемещаться со скоростью, уменьшенной вдвое. Точно так же, сферу могут поднять и переносить другие существа. Заклинание распад, нацеленное на сферу, уничтожает её, не причиняя вреда тому, что находится внутри.",
          castTime: "1 действие",
          distance: "30 футов",
          components: "В, С, М (полусферический кусочек чистого кристалла и такая же по размерам полусфера из гуммиарабика)",
          duration: "Концентрация, вплоть до 1 минуты",
          magicSchool: "Воплощение",
          ritual: "Не ритуал"
        },
      ],
    }
  },
  components: {Card}
}
</script>

<style scoped>

</style>